---
kind: method
id: M:Autodesk.Revit.DB.RevitLinkType.GetConversionData
source: html/9809ada4-fced-197c-7e4c-f339e75a2b80.htm
---
# Autodesk.Revit.DB.RevitLinkType.GetConversionData Method

Returns the optional data that is necessary to generate the Revit file for this link.

## Syntax (C#)
```csharp
public LinkConversionData GetConversionData()
```

## Returns
The RvtLinkConversionData containing the necessary information.